Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеализацияТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АгентскиеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОтчетКомитентуОПродажах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОтчетКомитентуОПродажах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийОтчетКомитентуОПродажах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтавкаНДСВознаграждения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭТ_ДоговорТО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДСВознаграждения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВознаграждения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Покупатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаРеализации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументРасчетов</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДоговорыКонтрагентов</Name>
			<Hierarchical>true</Hierarchical>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорРеализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБрони</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/РеализацияТоваровУслуг/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда




//Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
//	
//	Документы.РеализацияТоваровУслуг.ДобавитьКомандыСозданияНаОсновании(
//	РасходныйОрдерНаТовары.ДобавитьКомандуСоздатьНаОснованииРасходныйОрдерНаТовары(КомандыСозданияНаОсновании);
//	
//КонецПроцедуры



//Добавляем команду печати Бухгалтерской справки  в подменю Печать
&Перед("ДобавитьКомандыПечати")
Процедура ЭТ_ДобавитьКомандыПечати(КомандыПечати) Экспорт
// Бухгалтерская справка
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЭТ_БухгалтерскаяСправка";
	КомандаПечати.Представление = НСтр("ru = 'Бухгалтерская справка'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаВыбора,ФормаДокументаОбщая";
	КомандаПечати.Порядок = 200;
	
КонецПроцедуры

// Сформировать печатные формы объектов
&После("Печать")
Процедура ЭТ_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЭТ_БухгалтерскаяСправка") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЭТ_БухгалтерскаяСправка", "Бухгалтерская справка", 
			СформироватьБухгалтерскуюСправку(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,"Документ.РеализацияТоваровУслуг.ЭТ_БухгалтерскаяСправка");
		КонецЕсли;
		
	ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода);
		
КонецПроцедуры

//Функция формирования бухгалтерской справки
&НаСервере
Функция СформироватьБухгалтерскуюСправку(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_ЭТ_БухгальерскаяСправка";
		
	ПервыйДокумент = Истина;
	Для Каждого СледДокумент из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;		
		Макет = Документы.РеализацияТоваровУслуг.ПолучитьМакет("ЭТ_БухгалтерскаяСправка");
		Область = Макет.ПолучитьОбласть("ПечатнаяФормаДокумента");
		Область.Параметры.НомерЗаявки = СледДокумент.ДоговорКонтрагента.Номер;
		Область.Параметры.ОрганизацияНаименование = СледДокумент.Организация.НаименованиеПолное;
		Область.Параметры.ОрганизацияГород = РаботаСАдресами.ГородАдресаКонтактнойИнформации(БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(СледДокумент.Организация,СледДокумент.Дата).ЗначенияПолейЮридическийАдрес);
		Область.Параметры.НаименованиеДоверителя = СледДокумент.Контрагент.НаименованиеПолное;
		//получаем платежные документы за договором
		СуммаОплатыДоверителя = 0;
		ДатаПоследнегоПлатежа = 0;
		ПервыйШаг = Истина;
		ДокументыОплаты = ЭТ_ОбщийМодуль2.ПолучитьПлатежныеДокументыПоЗаявке(СледДокумент.ДоговорКонтрагента,СледДокумент.ДоговорКонтрагента.ВидДоговора).Выбрать();
		Пока ДокументыОплаты.Следующий() Цикл
			Если ДокументыОплаты.ОбратняяОперация = 0 Тогда
				СуммаОплатыДоверителя = СуммаОплатыДоверителя + ДокументыОплаты.СуммаДокумента;
				Если ПервыйШаг ИЛИ ДатаПоследнегоПлатежа<ДокументыОплаты.ДокументСсылка.Дата Тогда
					ДатаПоследнегоПлатежа = ДокументыОплаты.ДокументСсылка.Дата;
					ПервыйШаг = Ложь;
				КонецЕсли;
				
			Иначе
				СуммаОплатыДоверителя = СуммаОплатыДоверителя - ДокументыОплаты.СуммаДокумента;
			КонецЕсли;
		КонецЦикла;	
		Область.Параметры.СуммаОплатыДоверителя = ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаОплатыДоверителя, СледДокумент.ВалютаДокумента); 
		Область.Параметры.СуммаОплатыДоверителяПрописью = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(СуммаОплатыДоверителя, СледДокумент.ВалютаДокумента);
		Область.Параметры.ДатаПоследнегоПлатежа = Формат(ДатаПоследнегоПлатежа,"ДФ=dd.MM.yyyy");
		СуммаОплатТО = 0;
		КомиссияТО = 0;
		Для Каждого СледСтрока Из СледДокумент.АгентскиеУслуги Цикл
			КомиссияТО = КомиссияТО + ЭТ_ОбщийМодуль2.ПолучитьСуммуКомиссииТО(СледСтрока.ДоговорКонтрагента);
			СуммаОплатТО = СуммаОплатТО + СледСтрока.Сумма;
		КонецЦикла;
		Область.Параметры.СуммаОплатТО = ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаОплатТО, СледДокумент.ВалютаДокумента); 
		Область.Параметры.СуммаОплатТОПрописью = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(СуммаОплатТО, СледДокумент.ВалютаДокумента);
		СуммаВознагражденияПоверенного = СуммаОплатыДоверителя-СуммаОплатТО;
		Область.Параметры.СуммаВознагражденияПоверенного = ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаВознагражденияПоверенного, СледДокумент.ВалютаДокумента); 
		Область.Параметры.СуммаВознагражденияПоверенногоПрописью = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(СуммаВознагражденияПоверенного, СледДокумент.ВалютаДокумента);
		//До 01.12.2018 в 1С не велась дата заезда, по этому, если дата пустая, то здесь мы обновляем договор контрагента, и подставляем дату из заявки
		ДатаЗ = СледДокумент.ДоговорКонтрагента.ДатаНачала;
		Если ДатаЗ = Дата(1, 1, 1, 0, 0, 0) Тогда 
			ДатаЗаездаИзЗаявки = ЭТ_ОбщийМодуль2.ПолучитьДатуЗаезда(СледДокумент);
			Если ДатаЗаездаИзЗаявки <> Дата(1, 1, 1, 0, 0, 0) Тогда 
				СпрДоговорСсылка = Справочники.ДоговорыКонтрагентов.НайтиПоКоду(СледДокумент.ДоговорКонтрагента.Код);
				СпрДоговор = СпрДоговорСсылка.ПолучитьОбъект();
				СпрДоговор.ДатаНачала = ДатаЗаездаИзЗаявки;
				СпрДоговор.Записать();
				Область.Параметры.ДатаОказанияУслуг = Формат(ДатаЗаездаИзЗаявки,"ДФ=dd.MM.yyyy");
			Иначе
				Область.Параметры.ДатаОказанияУслуг = "";
			КонецЕсли;
		Иначе 
			Область.Параметры.ДатаОказанияУслуг = Формат(ДатаЗ,"ДФ=dd.MM.yyyy");//ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВДату(ДатаЗ);
		КонецЕсли;
		
		
		
		
		Если ЭТ_ОбщийМодуль2.ПолучитьНастройку("РеализацияКомиссияТО",0) = 0 Тогда
			Область.Параметры.КомиссияТО = ОбщегоНазначенияБПВызовСервера.ФорматСумм(КомиссияТО, СледДокумент.ВалютаДокумента); 
			Область.Параметры.КомиссияТОПрописью = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(КомиссияТО, СледДокумент.ВалютаДокумента);
		Иначе
			КТО_Запрос = Новый Запрос;
			КТО_Запрос.Текст = "ВЫБРАТЬ
								|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаВознаграждения) КАК СуммаВознаграждения,
								|	ОтчетКомитентуОПродажах.ДоговорКонтрагента КАК ДоговорКонтрагента
								|	ИЗ
								|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
								|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
								|		ПО (ОтчетКомитентуОПродажахТовары.Ссылка = ОтчетКомитентуОПродажах.Ссылка)
								|	ГДЕ
								|	ОтчетКомитентуОПродажах.ДоговорКонтрагента В
								|		(
								|			ВЫБРАТЬ
								|				РеализацияТоваровУслугАгентскиеУслуги.ДоговорКонтрагента КАК ДоговорКонтрагента
								|			ИЗ
								|				Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
								|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
								|					ПО (РеализацияТоваровУслугАгентскиеУслуги.Ссылка = РеализацияТоваровУслуг.Ссылка)
								|			ГДЕ
								|				РеализацияТоваровУслуг.Ссылка = &СледДокумент1							
								|		)
								|		
								|	СГРУППИРОВАТЬ ПО ОтчетКомитентуОПродажах.ДоговорКонтрагента
								|";
			КТО_Запрос.УстановитьПараметр("СледДокумент1",СледДокумент.Ссылка);
			КТО_Результат=КТО_Запрос.Выполнить();
			КТО_ТЗ = КТО_Результат.Выгрузить();
			СуммаВознаграждения = КТО_ТЗ.Итог("СуммаВознаграждения");
			Область.Параметры.КомиссияТО = ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаВознаграждения, СледДокумент.ВалютаДокумента); 
			Область.Параметры.КомиссияТОПрописью = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(СуммаВознаграждения, СледДокумент.ВалютаДокумента);
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Область);
	КонецЦикла;	
	Возврат  ТабличныйДокумент;
КонецФункции

#КонецЕсли
